# Durchschnittlicher Zigarettenpreis in Deutschland 1965–2025
# Preis pro Packung (20 Stück) in Cent

jahre = [
    1965, 1970, 1975, 1980, 1985, 1990, 1995, 2000,
    2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012,
    2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020,
    2021, 2022, 2023, 2024, 2025
]


preis_cent = [
    4.38,  4.73,  5.96,  7.45,  9.57, 10.82, 12.39, 13.73,
   20.38, 21.31, 21.85, 22.08, 22.65, 22.98, 23.58, 24.40,
   25.10, 25.73, 26.70, 27.36, 28.17, 29.12, 30.13, 30.88,
   31.65, 33.27, 35.18, 36.65, 38.10
]

# Вариант 1: простой список кортежей (как в твоём примере)
daten_tabelle = list(zip(jahre, preis_cent))